'''print("เลือกเมนูเพื่อทำรายการ")
print("กด 1 เลือกเหมาจ่าย")
print("กด 2 เลือกจ่ายเพิ่ม")
x=int(input(""))
if x==1:
    print("กรุณากรอกระยะทาง")
    y=int(input(""))
    if y<=25:
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท")
    else:
        print("ค่าใช่จ่ายทั้งหมด 80 บาท")
elif x==2:
    print("กรุณากรอกระยะทาง")
    y=int(input(""))
    if y<25:
        print("ค่าใช้จ่ายรวมทั้งหมด 25 บาท")
    else:
        print("ค่าใช่จ่ายทั้งหมด 55 บาท")'''

'''i=0
sum=0
x=int(input("กรุณากรอกจำนวนการรับค่า"))
while(i<x):
    y=int(input("กรอกตัวเลข : "))
    i+=1
    sum=sum+y
print("ผลรวมค่าที่รับมาทั้งหมด : ",sum)'''


'''food=[]
i=1
print("ป้อนชื่ออาหารของคุณ หรือ exit เพื่อออกจากโปรแกรม")
while(i>0):
    a=input(print("รายการอาหารสุดโปรดของคุณตามลำดับ \t"))
    i+=1        
    if a == "exit":
        break
    food.append(a)
print("อาหารของคุณมีดังนี้")
print(food)'''


'''print("\tร้านสิงห์ไอที")
print("\tเพิ่มข้อมูลลูกค้า[A]")
print("\tแสดงข้อมูลลูกค้า[B]")
print("\tออกจากโปรแกรม[X]")
while(True):
    f=int(input(print("เลือกโปรแกรม")))
    if f == 1:
        info=[]
        a=input(print("ป้อนรายการลูกค้า(รหัส:ชื่อ:จังหวัด"))
        info.append'''

'''a=[]
while True:
    b=input('-------SingIT-----\n เพิ่มข้อมูลลูกค้า [a]\n แสดงข้อมูลลูกค้า [s]\n ออกจากระบบ [x]\n')
    b=b.lower()
    if b=='a':
        c=input("ป้อนรายการลูกค้า(รหัส:ชื่อ:จังหวัด)")
        a.append(c)
        print("\n*******ข้อมูลเข้าสู่ระบบเเล้ว******\n")
    elif b=='s':
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        print('{0:-<8}{1:-<10}{2:10}'.format("รหัส","ชื่อ","จังหวัด"))
        print('{0:-<6}{0:-<10}{0:-<10}'.format(""))
        for d in a:
            e = d.split(":")
            print('{0[0]:<6} {0[1]:<10}({0[2]:<10})'.format(e))
            continue
    elif b =='x':
        break
print('ทำคำสั่งต่อไป')'''






